app/Controllers/Home.php

    public function index(): string
    {
        $lowongan = new Lowongan;
        $data['lowongans'] = $lowongan->findAll();
        $data['jumlahRekomLokers'] = $this->db->table('lowongans')->countAllResults();
---
SELECT *
FROM `lowongans`
SELECT COUNT(*) AS `numrows`
FROM `lowongans`